HELYXcore-4.4.0/examples/legacy/multiphase/interFoam/laminar/capillaryRise/0/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
8000
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    atmosphere
    {
        type            zeroGradient;
    }
    walls
    {
        type            constantAlphaContactAngle;
        theta0          45;
        limit           gradient;
        value           nonuniform List<scalar>
800
(
1
1
1
1
1
1
1
1
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
